{
    "modules": [{
            "name": "MODULE_SUPERMARKET",
            "link": "supermarket",
            "chapters": [{
                    "chapterId": 1,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "Since Karin wants to keep her customers in the library for as long as possible, she had the idea of offering coffee and soft drinks. The readers are enthusiastic and the beverage business is doing so well that Karin now spends more time in the supermarket to buy the necessary ingredients than she would like. She finally comes up with the idea of asking Dev0 to do it.",
                            "de": "Da Karin Ihre Kunden möglichst lange in der Bibliothek behalten will, hatte Sie die Idee, Kaffee und Erfrischungsgetränke anzubieten. Die LeserInnen sind begeistert und das Getränkegeschäft läuft so gut, dass Karin mittlerweile mehr Zeit im Supermarkt verbringt, um nötige Zutaten zu kaufen, als ihr lieb ist. Sie hat schließlich die Idee, Dev0 darum zu bitten."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hi Dev0, can I ask a favor of you?",
                            "de": "Hi Dev0, kann ich dich um einen Gefallen bitten?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, what can I do for you?",
                            "de": "Natürlich, was kann ich für dich tun?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Unfortunately, there is hardly any milk left. Could you please go buy a pack?",
                            "de": "Es ist leider kaum noch Milch übrig. Könntest du bitte eine Packung kaufen gehen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Gladly, can you please explain to me how this shopping thing works?",
                            "de": "Gerne, kannst du mir bitte erklären, wie dieses Einkaufen funktioniert?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Thats is quite easy. You take this shopping list and look for all the items..",
                            "de": "Das ist ganz einfach. Du nimmst diese Einkaufsliste und suchst nach allen Artikeln.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "by going through the aisles from start to finish. And then you come back home!",
                            "de": "indem du durch die Gänge von Anfang bis Ende durchgehst. Und dann kommst du wieder nach Hause!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Thanks for the explanation, I can do it.",
                            "de": "Danke für die Erklärung, ich schaffe das."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Perfect, please hurry!",
                            "de": "Perfekt, bitte beeil dich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the supermarket..",
                            "de": "Dev0 begibt sich zum Supermarkt.."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "1a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 returns after a short while, to Karin's satisfaction.",
                            "de": "Dev0 kehrt zu Karins Zufriedenheit nach kurzer Zeit zurück."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Wow that was quick, thanks Dev0!",
                            "de": "Wow das ging ja schnell, vielen Dank Dev0!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "But suddenly the phone rings. It's the owner of the store where Dev0 was just shopping..",
                            "de": "Doch plötzlich klingelt das Telefon. Es ist der Inhaber des Geschäftes, in dem Dev0 eben einkaufen war.. "
                        },
                        {
                            "speaker": "Karin",
                            "en": "Dev0, you didn't pay for the milk?!",
                            "de": "Dev0, du hast die Milch nicht bezahlt?!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Should I have done that? I can't find a word about it in the shopping manual you gave me.",
                            "de": "Hätte ich das tun sollen? In deiner Einkaufsanleitung finde ich davon kein Wort."
                        },
                        {
                            "speaker": "Karin",
                            "en": "But it goes without saying that you pay for the purchase...",
                            "de": "Aber das ist doch ganz selbstverständlich, dass man den Einkauf bezahlt..."
                        },
                        {
                            "speaker": "Robot",
                            "en": "Not for me. But I will pay from now on!",
                            "de": "Nicht für mich. Aber ich werde ab jetzt bezahlen!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "All right.. you should go back to the shop and give the owner the money for the milk, please!",
                            "de": "Also gut.. du müsstest gleich noch mal zurück in den Laden und dem Inhaber das Geld für die Milch geben, bitte!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "And once you're there, please pick up some bananas as well!",
                            "de": "Und wenn du drüben bist, kauf doch bitte gleich noch Bananen ein!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Alright, on my way!",
                            "de": "Mache ich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "And so Dev0 goes back to the supermarket to pay off the debt and make another purchase..",
                            "de": "Und so begibt sich Dev0 zurück in den Supermarket, um die Schulden zu begleichen und einen weiteren Einkauf zu tätigen.."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "1b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "After successful payment at the checkout, Dev0 goes back home.",
                            "de": "Nach erfolgreicher Bezahlung an der Kasse, macht sich Dev0 zurück nach Hause."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Did everything work out? Did you pay this time too?",
                            "de": "Hat alles geklappt? Hast du diesmal auch bezahlt?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, at the end of the shopping you have to pay!",
                            "de": "Natürlich, am Ende des Einkaufs hat man zu bezahlen!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Exactly!",
                            "de": "Genau!"
                        }


                    ],
                    "simulations": [{
                            "name": "1a",
                            "algorithm": 1,
                            "supermarket": "SMALL",
                            "shoppingList": ["MILK"]
                        },
                        {
                            "name": "1b",
                            "algorithm": 2,
                            "supermarket": "SMALL",
                            "shoppingList": ["BANANA"]
                        }
                    ]
                },
                {
                    "chapterId": 2,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "Karin is once again very busy and therefore asks Dev0 for another purchase",
                            "de": "Karin hat wieder viel zu tun und bittet Dev0 um einen weiteren Einkauf"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Dev0, could you go shopping for me again, please?",
                            "de": "Dev0, könntest du bitte wieder für mich Einkaufen gehen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Gladly, what is required?",
                            "de": "Gerne, was wird benötigt?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "I need yoghurt and chocolate.",
                            "de": "Und zwar bräuchte ich Yoghurt und Schokolade."
                        },
                        {
                            "speaker": "Karin",
                            "en": "But there is no chocolate at the store from last time. So you would have to go to the larger supermarket on Mediumstrasse",
                            "de": "Schokolade gibt es aber nicht bei dem Laden vom letzten mal. Du müsstest also bitte in den größeren Supermarkt in der Mediumstraße"
                        },
                        {
                            "speaker": "Robot",
                            "en": "All right, I'll be on my way immediately.",
                            "de": "Alles klar, ich mache mich sofort auf den Weg."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Great, thanks!",
                            "de": "Super, danke!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the slightly larger supermarket. He uses the same algorithm...",
                            "de": "Dev0 begibt sich zum etwas größeren Supermarkt. Er geht nach dem selben Algorithmus vor..."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "2a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Much later, Dev0 finally comes home. Karin is shocked.",
                            "de": "Deutlich später kommt Dev0 endlich nach Hause. Karin ist entsetzt.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "What happened? I already thought you got lost.",
                            "de": "Was ist denn passiert? Ich dachte schon, du bist verloren gegangen."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I do not know what you mean. I did exactly the same thing as last time.",
                            "de": "Ich weiß nicht, was du meinst. Ich habe genau das selbe gemacht wie das letzte mal."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Can you tell me step by step what you did?",
                            "de": "Kannst du mir Schritt für Schritt berichten, was du gemacht hast?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, I..",
                            "de": "Natürlich, und zwar.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "entered the supermarket, it was the first aisle...",
                            "de": "Betrat ich den Supermarkt, dann ging is in den ersten Gang..."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I looked at the first item, it was 'milk'...",
                            "de": "Ich sah mir den ersten Artikel an, es handelte sich um 'Milch'..."
                        },
                        {
                            "speaker": "Robot",
                            "en": "This article did not equal the desired article 'Yoghurt'.",
                            "de": "Dieser Artikel entsprach nicht dem gewünschten Artikel 'Yoghurt'."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I went to the next article, it was 'yogurt'.",
                            "de": "Ich ging zum nächsten Artikel, es handelte sich um 'Yoghurt'."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I removed the item from the shopping list.",
                            "de": "Ich konnte den Artikel von der Einkaufsliste streichen."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I went to the next article, it was 'cheese'",
                            "de": "Ich ging zum nächsten Artikel, es handelte sich um 'Käse'"
                        },
                        {
                            "speaker": "Robot",
                            "en": "This article did not equal the desired article 'yogurt'.",
                            "de": "Dieser Artikel entsprach nicht dem gewünschten Artikel 'Yoghurt'."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Wait a second! You are still comparing with yogurt?",
                            "de": "Moment! Du vergleichst noch immer mit Yoghurt?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Certainly. I walk up and down all the aisles for each item",
                            "de": "Na klar. Ich gehe für jeden Artikel alle Gänge auf und ab"
                        },
                        {
                            "speaker": "Karin",
                            "en": "So that's why it took you so long. From now on, if you've found an article, feel free to move on to the next article, ok?",
                            "de": "Darum hast du also so lange gebraucht.. Ab jetzt, wenn du einen Artikel gefunden hast, kannst du ruhig schon mit dem nächsten Artikel anfangen, ok?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "And when you have all the items, you can go straight to the checkout",
                            "de": "Und wenn du alle Artikel hast, kannst du gleich zur Kasse gehen"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I understand.",
                            "de": "Ich verstehe."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Alright then. Do you want to try again? I still need cheese and coffee anyway",
                            "de": "Dann ist gut. Willst du es noch einmal versuchen? Ich bräuchte ohnehin noch Käse und Kaffee"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course!",
                            "de": "Selbstverständlich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the supermarket...",
                            "de": "Dev0 begibt sich zum Supermarkt..."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "2b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "This time Dev0 only takes around half the time as last time. Katrin is pleased with the progress.",
                            "de": "Dev0 braucht diesmal nur fast die Hälfte der Zeit wie letztes mal. Katrin ist erfreut über den Fortschritt."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Are you back already? I assumed it would take longer, thank you!",
                            "de": "Du bist schon wieder da? Ich habe schlimmeres berfürchtet, danke dir!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Always at your service!",
                            "de": "Immer zu Diensten!"
                        }
                    ],
                    "simulations": [{
                            "name": "2a",
                            "algorithm": 2,
                            "supermarket": "MEDIUM",
                            "shoppingList": ["YOGURT", "CHOCOLATE"]
                        },
                        {
                            "name": "2b",
                            "algorithm": 3,
                            "supermarket": "MEDIUM",
                            "shoppingList": ["CHEESE", "COFFEE"]
                        }
                    ]
                },
                {
                    "chapterId": 3,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "A new day begins and Karin has another request for Dev0..",
                            "de": "Ein neuer Tag beginnt und Karin hat wieder eine Bitte an Dev0.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hi Dev0, can I ask you a favor again?",
                            "de": "Hi Dev0, kann ich dich wieder um einen Gefallen bitten?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, should I go shopping again?",
                            "de": "Natürlich, soll ich wieder einkaufen gehen?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Exactly, I really need soy milk. You should be able to get some at the small shop.",
                            "de": "Genau, und zwar brauche ich ganz dringend Sojamilch. Die solltest du auch beim kleinen Laden bekommen können."
                        },
                        {
                            "speaker": "Robot",
                            "en": "All right, I'll take care of it!",
                            "de": "Alles klar, ich kümmere mich darum!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Great, see you then!",
                            "de": "Spitze, bis dann!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the supermarket...",
                            "de": "Dev0 begibt sich zum Supermarkt..."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "3a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Karin waits and waits, but Dev0 doesn't come back. She eventually decides to go to the store herself.",
                            "de": "Karin wartet und wartet, aber Dev0 kommt nicht zurück. Sie beschließt schließlich, selbst zum Laden zu gehen."
                        },
                        {
                            "speaker": "Karin",
                            "en": "There you are, what are you doing for so long?",
                            "de": "Da bist du ja, was machst du denn so lange?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I'm looking for soy milk. I'm currently starting on round 63.",
                            "de": "Ich suche nach Sojamilch. Aktuell starte ich in Runde 63."
                        },
                        {
                            "speaker": "Karin",
                            "en": "What do you mean by that? Can you explain to me what happened?",
                            "de": "Was meinst du damit? Kannst du mir erklären, was passiert ist?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, I..",
                            "de": "Natürlich, und zwar.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "walked the aisles as discussed and compared each item to soy milk",
                            "de": "Ging ich durch die Gänge wie besprochen und verglich jeden Artikel mit Sojamilch"
                        },
                        {
                            "speaker": "Robot",
                            "en": "When I got to the end of the last aisle, I started from the beginning, that is, into the next round..",
                            "de": "Als ich am Ende des letzten Ganges angekommen war, startete ich von vorne, also in die nächste Runde.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "because I hadn't found all the articles yet",
                            "de": "weil ich noch nicht alle Artikel gefunden hatte"
                        },
                        {
                            "speaker": "Robot",
                            "en": "And currently I've walked the aisles from start to finish 62 times.",
                            "de": "Und aktuell bin ich bereits 62 mal von Anfang bis Ende durch die Gänge gelaufen."
                        },
                        {
                            "speaker": "Robot",
                            "en": "But unfortunately I haven't found the soy milk yet, but I'll keep looking!",
                            "de": "Aber die Soja Milch habe ich leider noch nicht gefunden, ich versuche es aber weiterhin!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "No you don't have to do that that! There apparently is no soy milk here. If an article isn't available, feel free to come home",
                            "de": "Nein das brauchst du nicht! Soja Milch gibt es wohl hier nicht. Wenn es einen Artikel nicht gibt, dann komm ruhig nach Hause"
                        },
                        {
                            "speaker": "Karin",
                            "en": "And anyway, you only need to go through all the aisles once anyway, what are these rounds for?",
                            "de": "Und ohnehin brauchst du doch eh nur einmal durch alle Gänge gehen, wozu diese Runden?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I always start from the first aisle for every item I'm looking for",
                            "de": "Ich starte für jeden Artikel, den ich suche, immer von vorne"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Does that mean you're only looking for one item at a time?",
                            "de": "Meinst du, du suchst immer nur nach einem Artikel gleichzeitig?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Yes, for the item at the top of the list",
                            "de": "Ja, nach dem obersten auf der Liste"
                        },
                        {
                            "speaker": "Karin",
                            "en": "That's much too slow, search for all articles at once instead.",
                            "de": "Das ist doch viel zu langsam, suche doch stattdessen nach allen Artikeln gleichzeitig."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I understand..",
                            "de": "Ich verstehe.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Okay then. Come, let's go home!",
                            "de": "Sehr gut. Komm, lass uns gehen!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Back in the library...",
                            "de": "Wieder zurück in der Bibliothek.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hmm I still need soy milk, but if the little shop doesn't have it...",
                            "de": "Hmm Sojamilch bräuchte ich eigentlich immer noch, aber wenn es die im kleinen Laden nicht gibt.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Could you please run to the larger store on Mediumstrasse?",
                            "de": "Könntest du bitte schnell zum größeren Geschäft in der Mediumstrasse laufen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "With pleasure, do you need anything else?",
                            "de": "Sehr gerne, brauchst du sonst noch etwas?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Please also bring some apples and soap too!",
                            "de": "Nimm mir auch noch Äpfel und Seife mit, bitte!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I'm on my way!",
                            "de": "Ich mache mich auf den Weg!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "You can do it!",
                            "de": "Du schaffst das!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to supermarket with an improved algorithm...",
                            "de": "Dev0 begibt sich mit verbessertem Algorithmus zum Supermarkt..."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "3b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Even though the supermarket was the biggest so far, Dev0 comes back quite quickly",
                            "de": "Obwohl der Supermarkt der bisher größte war, kommt Dev0 recht schnell zurück"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Wow Dev0, you're making great progress!",
                            "de": "Wow Dev0, du machst tolle Fortschritte!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Thank you, I'm looking forward to the next time!",
                            "de": "Vielen Dank, ich freue mich auf's nächste mal!"
                        }
                    ],
                    "simulations": [{
                            "name": "3a",
                            "algorithm": 3,
                            "supermarket": "SMALL",
                            "shoppingList": ["SOY-MILK"]
                        },
                        {
                            "name": "3b",
                            "algorithm": 4,
                            "supermarket": "MEDIUM",
                            "shoppingList": ["SOY-MILK", "APPLE", "SOAP"]
                        }
                    ]
                },
                {
                    "chapterId": 4,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "The library has had more customers than ever since offering drinks. Karin knows she will need to use Dev0's shopping service more often in the future. She therefore considers whether there is still room for improvement.",
                            "de": "Die Bibliothek hat seit dem Anbieten von Getränken so viele Kunden wie noch nie. Karin weiß, sie wird Dev0s Einkaufsservice in Zukunft noch öfter in Anspruch nehmen müssen. Sie überlegt daher, ob es noch Verbesserungspotenzial gibt.. "
                        },
                        {
                            "speaker": "Karin",
                            "en": "Listen Dev0, I've been thinking about what to do when I go shopping..",
                            "de": "Hör mal Dev0, ich habe mir überlegt, wie ich vorgehe wenn ich einkaufen gehe.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "When I'm looking for milk, for example, I don't go through all the aisles, I only go to the refrigerated section.",
                            "de": "Ich gehe, wenn ich z.b Milch suche, nicht alle Gänge ab, sondern gehe nur in die Kühlabteilung.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "If I don't need anything else from the refrigeration department, I go straight on because it's clear that I won't find anything else here",
                            "de": "Wenn ich sonst nichts brauche aus der Kühlabteilung, gehe ich gleich weiter weil klar ist, dass ich hier nichts mehr finde"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Do you understand what I mean?",
                            "de": "Verstehst du, was ich meine?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "How do I know which aisle contains which item?",
                            "de": "Woher weiß ich, welcher Gang welchen Artikel beinhaltet?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "I thought I'd put the info on your shopping list...",
                            "de": "Ich habe mir gedacht, ich schreib es dir mit auf die Einkaufsliste,.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Then you can skip aisles that are not on the list.",
                            "de": "Dann kannst du Gänge auslassen, die nicht auf der Liste stehen."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I understand!",
                            "de": "Ich verstehe!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Do you want to start a test purchase? I would need cheese, chocolate and sausages anyway",
                            "de": "Wollen wir einen Testkauf starten? Ich bräuchte ohnehin Käse, Schokolade und Würstchen"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Gladly, I'll be on my way.",
                            "de": "Gerne, ich mache mich auf den Weg."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the supermarket. He uses the once more improved algorithm...",
                            "de": "Dev0 begibt sich zum Supermarkt. Er verwendet den wiedermals verbesserten Algorithmus ..."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "4"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "After a short time Dev0 comes back again..",
                            "de": "Nach kurzer Zeit kommt Dev0 wieder zurück.. "
                        },
                        {
                            "speaker": "Karin",
                            "en": "I'm blown away, that was almost as fast as me!",
                            "de": "Ich bin hin und weg, das war ja fast so schnell wie ich!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Thank you very much!",
                            "de": "Vielen Dank!"
                        }
                    ],
                    "simulations": [{
                        "name": "4",
                        "algorithm": 5,
                        "supermarket": "MEDIUM",
                        "shoppingList": ["CHEESE", "CHOCOLATE", "SAUSAGE"]
                    }]
                },
                {
                    "chapterId": 5,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "Karin has another new assignment for Dev0.",
                            "de": "Karin hat wieder einen neuen Auftrag für Dev0. "
                        },
                        {
                            "speaker": "Karin",
                            "en": "Would you be so kind again and go shopping for me?",
                            "de": "Wärst du wieder so freundlich, und gehst für mich einkaufen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "With pleasure! What should it be?",
                            "de": "Mit Vergnügen! Was soll es sein?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "I need tangerines, cucumbers, spinach and lemonade this time",
                            "de": "Ich brauche diesmal Mandarinen, Gurken, Spinat und Limonade"
                        },
                        {
                            "speaker": "Karin",
                            "en": "But for that you would have to go to the Giga supermarket, as only there all articles are available.",
                            "de": "Dazu müsstest du aber in den Giga Supermarkt, denn nur dort gibt es alles."
                        },
                        {
                            "speaker": "Robot",
                            "en": "All right, I'm on my way.",
                            "de": "Alles klar, ich mache mich auf den Weg."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Thank you, see you soon!",
                            "de": "Danke, bis gleich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 goes to the Giga Supermarket..",
                            "de": "Dev0 macht sich auf zum Giga Supermarkt.."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": ".",
                            "showSimulation": "5a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "The search takes longer than expected, but Dev0 eventually comes back.",
                            "de": "Die Suche dauert länger als erwartet, aber Dev0 kommt schließlich zurück."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hmm, somehow that wasn't as fast as I would have hoped.. The bigger the supermarket, the longer the search..",
                            "de": "Hmm, das war irgendwie nicht so schnell, wie ich es erhofft hätte.. Je größer der Supermarkt, desto länger die Suche.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "I'm wondering if there's another way you can go a little faster..",
                            "de": "Ich frage mich, ob es noch einen Weg gibt, wie du noch etwas schneller werden kannst.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "But I can't think of anything anymore... I've got it! I ask my friend Markus, who is a computer scientist",
                            "de": "Aber mir fällt da nichts mehr ein... Ich hab's! Ich frage meinen Freund Markus, der ist Informatiker"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Maybe he has some trick up his sleeve!",
                            "de": "Vielleicht hat der noch einen Trick auf Lager!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Markus explains to Karin that the shopping problem is very similar to a problem called the Traveling Salesman Problem, where a salesman needs to get to all cities, but only wants to visit each city once. In the end he wants to return to the starting city. To find the optimal path, all routes would have to be calculated, which would require a lot of computing power.",
                            "de": "Markus erklärt Karin, dass das Problem des Einkaufens sehr ähnlich zu einem namens Traveling Salesman Problem ist, wo es darum geht, dass ein Verkäufer zu allen Städten will, aber nur einmal und zum Schluss wieder am Anfang ankommen will. Um den optimalen Pfad zu finden, müssten alle Routen berechnet werden, was sehr viel Rechenleistung in Anspruch nimmt."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "However, there are algorithms that use heuristics, such as the shortest route from one city to another (or, as in our case, articles), to deliver a very good result",
                            "de": "Es gibt jedoch Algorithmen, die anhand von Heuristiken, wie zum Beispiel dem kürzesten Weg von einer Stadt zu einer anderen (oder wie bei uns, Artikeln) ein sehr gutes Ergebnis liefern"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Markus also explains that in order to be able to use this algorithm, you would only need all the positions or coordinates of the articles. Luckily there are just such for the supermarkets to be found on the internet",
                            "de": "Markus erklärt weiters, dass man, um diesen Algorithmus anweden zu können, lediglich alle Standpunkte bzw Koordinaten der Artikel benötigen würde. Glücklicherweiße gibt es genau solche für die Supermärkte im Internet zu finden"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Look Dev0! I have a map for you with the coordinates of all the items in the supermarket and this algorithm from Markus",
                            "de": "Schau mal, Dev0! Ich habe hier für dich eine Karte mit Koordinaten der ganzen Artikel im Supermarkt und diesen Algorithmus dazu von Markus"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Using it will give you the best route for each purchase. He said you probably know what to do.",
                            "de": "Wenn du den anwendest, bekommst du die beste Route für jeden Einkauf. Er meinte, du weißt bestimmt, was zu tun ist.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "Thank you, yes this is not difficult for me as a robot to understand",
                            "de": "Vielen Dank, ja das ist für mich als Roboter nicht schwer zu verstehen"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Great, can I ask you for a shopping spree right away?",
                            "de": "Super, kann ich dich dann gleich um eine Einkaufstour bitten?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, what should I buy?",
                            "de": "Natürlich, was soll ich kaufen?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "I need apples, chips, soy milk, coffee, chocolate and yogurt. Do you think you can do it?",
                            "de": "Ich brauche Äpfel, chips, Soja Milch, Kaffee, Schokolade und Joghurt. Denkst du, das kriegst du hin?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I can do it!",
                            "de": "Das schaffe ich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 makes his way to the Giga Supermarket",
                            "de": "Dev0 macht sich auf den Weg in den Giga Supermarkt"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "5b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 returns after a succesful purchase..",
                            "de": "Nach erfolgreichem Einkauf kommt Dev0 zurück.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Unbelievable, now you've really become a master of shopping!",
                            "de": "Unglaublich, jetzt bist du wirklich ein Meister im Einkaufen geworden!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Thank you very much!",
                            "de": "Vielen Dank!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "You have reached the end of the supermarket story. Make your way to the laboratory and try your hand at customized shopping lists and combine them with the algorithm and supermarket of your choice!",
                            "de": "Du bist am Ende der Supermarkt Story angelangt. Mach dich auf den Weg ins Labor und versuche dich an individuell angepassten Shoppinglisten und kombiniere mit Algorithmus und Supermarkt deiner Wahl!"
                        }


                    ],
                    "simulations": [{
                            "name": "5a",
                            "algorithm": 5,
                            "supermarket": "LARGE",
                            "shoppingList": ["TANGERINE", "CUCUMBER", "SPINACH", "LEMONADE"]
                        },
                        {
                            "name": "5b",
                            "algorithm": 6,
                            "supermarket": "LARGE",
                            "shoppingList": ["APPLE", "CHIPS", "SOY-MILK", "COFFEE", "CHOCOLATE", "YOGURT"]
                        }
                    ]
                }
            ],
            "algorithms": [{
                    "algorithmNr": 1,
                    "name": "1",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betritt den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the shopping list and search for all these articles",
                            "de": "Nimm die Einkaufsliste und suche nach all diesen Artikeln",
                            "indent": 0
                        },
                        {
                            "en": "by going through the aisles from start to finish",
                            "de": "Indem du durch die Gänge von Anfang bis Ende durchgehst",
                            "indent": 0
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                },
                {
                    "algorithmNr": 2,
                    "name": "2",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betritt den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the shopping list and search for all these articles",
                            "de": "Nimm die Einkaufsliste und suche nach all diesen Artikeln",
                            "indent": 0
                        },
                        {
                            "en": "by going through the aisles from start to finish",
                            "de": "Indem du durch die Gänge von Anfang bis Ende durchgehst",
                            "indent": 0
                        },
                        {
                            "en": "Pay at the checkout",
                            "de": "Bezahle an der Kassa",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                },
                {
                    "algorithmNr": 3,
                    "name": "3",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betritt den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the shopping list and search for all these articles",
                            "de": "Nimm die Einkaufsliste und suche nach all diesen Artikeln",
                            "indent": 0
                        },
                        {
                            "en": "until you found all",
                            "de": "bis du alle gefunden hast",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "by going through the aisles from start to finish",
                            "de": "Indem du durch die Gänge von Anfang bis Ende durchgehst",
                            "indent": 0
                        },
                        {
                            "en": "If you find an article",
                            "de": "Wenn du einen Artikel gefunden hast",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "search for the next one",
                            "de": "suche nach dem nächsten",
                            "indent": 1,
                            "highlight": true
                        },
                        {
                            "en": "Pay at the checkout",
                            "de": "Bezahle an der Kassa",
                            "indent": 0
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                },
                {
                    "algorithmNr": 4,
                    "name": "4",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betritt den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the shopping list and search for all these articles",
                            "de": "Nimm die Einkaufsliste und suche nach all diesen Artikeln",
                            "indent": 0
                        },
                        {
                            "en": "until you found all or an article is not available",
                            "de": "bis du alle gefunden hast oder es einen Artikel nicht gibt",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "by going through the aisles from start to finish",
                            "de": "Indem du durch die Gänge von Anfang bis Ende durchgehst",
                            "indent": 0
                        },
                        {
                            "en": "while comparing with all articles on the shopping list",
                            "de": "und mit allen Artikeln auf der Einkaufsliste vergleichst",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "If you find an article",
                            "de": "Wenn du einen Artikel gefunden hast",
                            "indent": 0
                        },
                        {
                            "en": "search for the next one",
                            "de": "suche nach dem nächsten",
                            "indent": 1
                        },
                        {
                            "en": "Pay at the checkout",
                            "de": "Bezahle an der Kassa",
                            "indent": 0
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                },
                {
                    "algorithmNr": 5,
                    "name": "5",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betritt den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the shopping list and search for all these articles",
                            "de": "Nimm die Einkaufsliste und suche nach all diesen Artikeln",
                            "indent": 0
                        },
                        {
                            "en": "until you found all or an article is not available",
                            "de": "bis du alle gefunden hast oder es einen Artikel nicht gibt",
                            "indent": 0
                        },
                        {
                            "en": "by going to the relevant aisles",
                            "de": "Indem du durch relevante Gänge gehst",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "and comparing with the articles on the shopping list from the aisle",
                            "de": "und mit den Artikeln auf der Einkaufsliste aus diesem Gang vergleichst",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "If you find an article",
                            "de": "Wenn du einen Artikel gefunden hast",
                            "indent": 0
                        },
                        {
                            "en": "search for the next one",
                            "de": "suche nach dem nächsten",
                            "indent": 1
                        },
                        {
                            "en": "Pay at the checkout",
                            "de": "Bezahle an der Kassa",
                            "indent": 0
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                },
                {
                    "algorithmNr": 6,
                    "name": "6",
                    "lines": [{
                            "en": "Enter the supermarket",
                            "de": "Betrete den Supermarkt",
                            "indent": 0
                        },
                        {
                            "en": "Take the map of item coordinates and calculate the shortes distances",
                            "de": "Nimm die Karte mit Koordinaten und berechne die Distanzen der Artikel",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "Apply the algorithm from Markus based on the distances",
                            "de": "Wende anhand der Distanzen den Algorithmus von Markus an",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "Go along the calculated shortest path and pick up the articles",
                            "de": "Gehe den Pfad ab, den du erhalten hast und nimm alle Artikel mit",
                            "indent": 0,
                            "highlight": true
                        },
                        {
                            "en": "Pay at the checkout",
                            "de": "Bezahle an der Kassa",
                            "indent": 0
                        },
                        {
                            "en": "Exit the supermarket",
                            "de": "Verlasse den Supermarkt",
                            "indent": 0
                        }
                    ]
                }
            ],
            "supermarketLayouts": [{
                    "name": "SMALL",
                    "shelfs": [{
                            "name": "VEGETABLES",
                            "items": ["TOMATO", "CUCUMBER", "SALAD"]
                        },
                        {
                            "name": "FRUITS",
                            "items": ["APPLE", "BANANA", "MELON"]
                        },
                        {
                            "name": "COOLER",
                            "items": ["MILK", "YOGURT", "CHEESE"]
                        },
                        {
                            "name": "FREEZER",
                            "items": ["SPINACH", "ICE-CREAM", "PIZZA"]
                        }
                    ]
                },
                {
                    "name": "MEDIUM",
                    "shelfs": [{
                            "name": "VEGETABLES",
                            "items": ["TOMATO", "CUCUMBER", "SALAD"]
                        },
                        {
                            "name": "FRUITS",
                            "items": ["APPLE", "BANANA", "MELON"]
                        },
                        {
                            "name": "COOLER",
                            "items": ["MILK", "YOGURT", "CHEESE"]
                        },
                        {
                            "name": "FREEZER",
                            "items": ["SPINACH", "ICE-CREAM", "PIZZA"]
                        },
                        {
                            "name": "DRINKS",
                            "items": ["COFFEE", "WATER", "SOY-MILK"]
                        },
                        {
                            "name": "MEAT",
                            "items": ["STEAK", "SAUSAGE", "MINCED-MEAT"]
                        },
                        {
                            "name": "SWEETS",
                            "items": ["CHOCOLATE", "POPCORN", "CHIPS"]
                        },
                        {
                            "name": "CLEANING",
                            "items": ["TOILET-PAPER", "SOAP", ""]
                        }
                    ]
                },
                {
                    "name": "LARGE",
                    "shelfs": [{
                            "name": "VEGETABLES",
                            "items": ["TOMATO", "", "SALAD", ""]
                        },
                        {
                            "name": "VEGETABLES",
                            "items": ["", "CUCUMBER", "AUBERGINE", ""]
                        },
                        {
                            "name": "FRUITS",
                            "items": ["APPLE", "BANANA", "", ""]
                        },
                        {
                            "name": "FRUITS",
                            "items": ["", "TANGERINE", "MELON", ""]
                        },
                        {
                            "name": "COOLER",
                            "items": ["", "YOGURT", "CHEESE", ""]
                        },
                        {
                            "name": "COOLER",
                            "items": ["MILK", "", "", ""]
                        },
                        {
                            "name": "FREEZER",
                            "items": ["SPINACH", "", "PIZZA", ""]
                        },
                        {
                            "name": "FREEZER",
                            "items": ["", "ICE-CREAM", "FISH", ""]
                        },
                        {
                            "name": "DRINKS",
                            "items": ["", "WATER", "COLA", ""]
                        },
                        {
                            "name": "DRINKS",
                            "items": ["COFFEE", "SOY-MILK", "LEMONADE", ""]
                        },
                        {
                            "name": "MEAT",
                            "items": ["", "SAUSAGE", "STEAK", ""]
                        },
                        {
                            "name": "MEAT",
                            "items": ["CHICKEN", "", "MINCED-MEAT", ""]
                        },
                        {
                            "name": "SWEETS",
                            "items": ["CHOCOLATE", "", "PRALINE", ""]
                        },
                        {
                            "name": "SWEETS",
                            "items": ["", "POPCORN", "CHIPS", ""]
                        },
                        {
                            "name": "CLEANING",
                            "items": ["TOILET-PAPER", "", "BROOM", ""]
                        },
                        {
                            "name": "CLEANING",
                            "items": ["", "SOAP", "TOOTH-BRUSH", ""]
                        }
                    ]
                }
            ],
            "challenges": [{
                    "challengeId": "1",
                    "name": {
                        "en": "first steps",
                        "de": "Erste Schritte"
                    },
                    "algorithm": 1,
                    "shoppingList": ["MELON", "SALAD"],
                    "supermarket": "SMALL",
                    "stopAtAnimation": 15,
                    "question": {
                        "en": "Where will Dev0 go next?",
                        "de": "Wohin wird Dev0 als nächstes gehen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "vegetables",
                            "de": "Gemüse"
                        },
                        {
                            "en": "checkout",
                            "de": "Kasse"
                        },
                        {
                            "en": "cooler",
                            "de": "Kühlwaren"
                        },
                        {
                            "en": "fruits",
                            "de": "Obst"
                        }
                    ],
                    "answer": "cooler",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "At this point, Dev0 still doesn't know he should search for the next article once he found one",
                            "de": "Dev0 weiß aktuell noch nicht, dass er nach dem nächsten Artikel suchen soll, sobald er einen gefunden hat."
                        }
                    }
                },
                {
                    "challengeId": "2",
                    "name": {
                        "en": "payday?",
                        "de": "Zahltag?"
                    },
                    "algorithm": 1,
                    "shoppingList": ["APPLE", "YOGURT", "BANANA", "MILK", "SPINACH", "PIZZA"],
                    "supermarket": "SMALL",
                    "stopAtAnimation": 218,
                    "question": {
                        "en": "Where will Dev0 go next?",
                        "de": "Wohin wird Dev0 als nächstes gehen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "vegetables",
                            "de": "Gemüse"
                        },
                        {
                            "en": "checkout",
                            "de": "Kasse"
                        },
                        {
                            "en": "exit",
                            "de": "Ausgang"
                        },
                        {
                            "en": "fruits",
                            "de": "Obst"
                        }
                    ],
                    "answer": "exit",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! Indeed Dev0 has not yet learned he needs to pay for his articles",
                            "de": "Gut gemacht! Tatsächlich hat Dev0 noch nicht gelernt, dass er die Artikel auch bezahlen muss"
                        },
                        "messageWrong": {
                            "en": "Take a look at the algorithm to see if something might be missing",
                            "de": "Schau dir den Algorithmus an, fehlt hier vielleicht etwas?"
                        }
                    }
                },
                {
                    "challengeId": "3",
                    "name": {
                        "en": "payday!",
                        "de": "Zahltag!"
                    },
                    "algorithm": 2,
                    "shoppingList": ["APPLE", "YOGURT", "BANANA", "MILK", "SPINACH", "PIZZA", "SALAD"],
                    "supermarket": "SMALL",
                    "stopAtAnimation": 218,
                    "question": {
                        "en": "Where will Dev0 go next?",
                        "de": "Wohin wird Dev0 als nächstes gehen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "vegetables",
                            "de": "Gemüse"
                        },
                        {
                            "en": "checkout",
                            "de": "Kasse"
                        },
                        {
                            "en": "exit",
                            "de": "Ausgang"
                        },
                        {
                            "en": "fruits",
                            "de": "Obst"
                        }
                    ],
                    "answer": "vegetables",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Nicely spotted, Dev0 was not yet finished shopping",
                            "de": "Gut erkannt, Dev0 war noch nicht fertig mit seinem Einkauf"
                        },
                        "messageWrong": {
                            "en": "It's a trap! Dev0 was not yet finished shopping",
                            "de": "Es ist eine Falle! Dev0 war noch nicht fertig mit seinem Einkauf"
                        }
                    }
                },
                {
                    "challengeId": "4",
                    "name": {
                        "en": "I'm done",
                        "de": "Bin fertig"
                    },
                    "algorithm": 2,
                    "shoppingList": ["ICE-CREAM", "SPINACH", "MELON", "CHEESE"],
                    "supermarket": "SMALL",
                    "stopAtAnimation": 135,
                    "question": {
                        "en": "Where will Dev0 go next?",
                        "de": "Wohin wird Dev0 als nächstes gehen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "vegetables",
                            "de": "Gemüse"
                        },
                        {
                            "en": "checkout",
                            "de": "Kasse"
                        },
                        {
                            "en": "exit",
                            "de": "Ausgang"
                        },
                        {
                            "en": "freezer",
                            "de": "Gefriertruhe"
                        }
                    ],
                    "answer": "freezer",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Dev0 does not yet know he can stop searching once he found all items",
                            "de": "Dev0 weiß noch nicht, dass er zu suchen aufhören kann, sobald er alle Artikel gefunden hat"
                        }
                    }
                },
                {
                    "challengeId": "5",
                    "name": {
                        "en": "restart",
                        "de": "Neuanfang"
                    },
                    "algorithm": 3,
                    "shoppingList": ["MINCED-MEAT", "BANANA", "SOAP"],
                    "supermarket": "MEDIUM",
                    "stopAtAnimation": 38,
                    "question": {
                        "en": "Where will Dev0 go next?",
                        "de": "Wohin wird Dev0 als nächstes gehen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "cleaning",
                            "de": "Reinigungsmittel"
                        },
                        {
                            "en": "fruits",
                            "de": "Obst"
                        },
                        {
                            "en": "cooler",
                            "de": "Kühlwaren"
                        },
                        {
                            "en": "checkout",
                            "de": "Kasse"
                        }
                    ],
                    "answer": "cooler",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Dev0 now already knows he can restart the search once he found an item",
                            "de": "Dev0 weiß mittlerweile, dass er die Suche neustarten kann, sobald er einen Artikel gefunden hat "
                        }
                    }
                },
                {
                    "challengeId": "6",
                    "name": {
                        "en": "am I done?",
                        "de": "Bin ich fertig?"
                    },
                    "algorithm": 3,
                    "shoppingList": ["CHEESE", "TOMATO", "SOAP"],
                    "supermarket": "MEDIUM",
                    "stopAtAnimation": 1,
                    "question": {
                        "en": "Will Dev0 search the sweets section?",
                        "de": "Wird Dev0 die Süßigkeiten Abteilung durchsuchen?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "no",
                            "de": "Nein"
                        },
                        {
                            "en": "yes",
                            "de": "Ja"
                        }
                    ],
                    "answer": "no",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Dev0 will only look through all sections under certain conditions. Look at the highlighted text in the code box!",
                            "de": "Dev0 wird nur unter bestimmten Voraussetzungen alle Abteilungen durchsuchen. Sieh dir den hervorgehobenen Text in der Code Box an!"
                        }
                    }
                },
                {
                    "challengeId": "7",
                    "name": {
                        "en": "+ efficiency",
                        "de": "+ Effizienz"
                    },
                    "algorithm": 4,
                    "shoppingList": ["CHIPS", "TOMATO", "CHEESE"],
                    "supermarket": "MEDIUM",
                    "stopAtAnimation": 16,
                    "question": {
                        "en": "What will Dev0 do next?",
                        "de": "Was wird Dev0 als nächstes tun?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "go vegetables",
                            "de": "Gehe Gemüse"
                        },
                        {
                            "en": "go sweets",
                            "de": "Gehe Süßigkeiten"
                        },
                        {
                            "en": "compare tomato",
                            "de": "Vergleiche Tomate"
                        },
                        {
                            "en": "compare cheese",
                            "de": "Vergleiche Käse"
                        }
                    ],
                    "answer": "compare tomato",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "The new algorithm allows Dev0 to search for all items at once, try again!",
                            "de": "Der neue Algorithmus erlaubt es Dev0, nach allen Artikeln auf einmal zu suchen, versuch' es noch einmal!"
                        }
                    }
                },
                {
                    "challengeId": "8",
                    "name": {
                        "en": "Wait what?",
                        "de": "Warte was?"
                    },
                    "algorithm": 4,
                    "shoppingList": [],
                    "supermarket": "MEDIUM",
                    "stopAtAnimation": 0,
                    "question": {
                        "en": "What will Dev0 do next?",
                        "de": "Was wird Dev0 als nächstes tun?",
                        "type": "text"
                    },
                    "choices": [

                        {
                            "en": "go exit",
                            "de": "Gehe Ausgang"
                        },
                        {
                            "en": "go checkout",
                            "de": "Gehe Kasse"
                        },
                        {
                            "en": "bug",
                            "de": "Fehler"
                        }
                    ],
                    "answer": "go checkout",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! Even though Dev0 has not bought anything, he is still following the steps of the algorithm which leads him to the checkout",
                            "de": "Gut gemacht! Obwohl Dev0 nichts gekauft hat, befolgt er dennoch die Schritte des Algorithmus, der ihn zur Kasse leitet"
                        },
                        "messageWrong": {
                            "en": "Even though Dev0 has not bought anything, he is still following the steps of the algorithm..",
                            "de": "Obwohl Dev0 nichts gekauft hat, befolgt er dennoch die Schritte des Algorithmus.."
                        }
                    }
                },
                {
                    "challengeId": "9",
                    "name": {
                        "en": "another upgrade",
                        "de": "Noch ein Upgrade"
                    },
                    "algorithm": 5,
                    "shoppingList": ["APPLE", "CUCUMBER", "COFFEE", "POPCORN", "ICE-CREAM", "SOAP", "WATER", "SALAD"],
                    "supermarket": "MEDIUM",
                    "stopAtAnimation": 0,
                    "question": {
                        "en": "Which sections will Dev0 noch search through",
                        "de": "Welche Abteilungen wird Dev0 nicht durchsuchen?",
                        "type": "text"
                    },
                    "choices": [

                        {
                            "en": "none",
                            "de": "Keine"
                        },
                        {
                            "en": "sweets+fruits",
                            "de": "Süßigkeiten+Obst"
                        },
                        {
                            "en": "meat+cooler",
                            "de": "Fleisch+Kühlwaren"
                        },
                        {
                            "en": "fruits+cooler",
                            "de": "Obst+Kühlwaren"
                        }
                    ],
                    "answer": "meat+cooler",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! ",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Take a closer look at the shopping list and the algorithm!",
                            "de": "Schau noch mal genauer auf die Einkaufsliste und den Algorithmus!"
                        }
                    }
                },
                {
                    "challengeId": "10",
                    "name": {
                        "en": "sweet choice",
                        "de": "Süße Wahl"
                    },
                    "algorithm": 5,
                    "shoppingList": ["POPCORN", "ICE-CREAM", "LEMONADE", "MELON"],
                    "supermarket": "LARGE",
                    "stopAtAnimation": 0,
                    "question": {
                        "en": "Which item will Dev0 find the last?",
                        "de": "Welchen Artikel wird Dev0 als letztes finden?",
                        "type": "text"
                    },
                    "choices": [

                        {
                            "en": "popcorn",
                            "de": "Popcorn"
                        },
                        {
                            "en": "ice-cream",
                            "de": "Eis"
                        },
                        {
                            "en": "lemonade",
                            "de": "Limonade"
                        },
                        {
                            "en": "melon",
                            "de": "Melone"
                        }
                    ],
                    "answer": "popcorn",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! ",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Dev0 is no longer bound to the order in which the articles are listed",
                            "de": "Dev0 muss sich nicht mehr an die Reihenfolge der Einkaufsliste halten"
                        }
                    }
                },
                {
                    "challengeId": "11",
                    "name": {
                        "en": "TSP 1",
                        "de": "TSP 1"
                    },
                    "algorithm": 6,
                    "shoppingList": ["CHICKEN", "TOOTH-BRUSH", "SOY-MILK", "MILK", "SPINACH", "YOGURT", "MELON", "APPLE"],
                    "supermarket": "LARGE",
                    "stopAtAnimation": 0,
                    "question": {
                        "en": "Where will Dev0 go after reaching the yogurt",
                        "de": "Wohin wird Dev0 gehen, sobald er das Joghurt erreicht hat?",
                        "type": "text"
                    },
                    "choices": [

                        {
                            "en": "spinach",
                            "de": "Spinat"
                        },
                        {
                            "en": "apple",
                            "de": "Apfel"
                        },
                        {
                            "en": "chicken",
                            "de": "Huhn"
                        },
                        {
                            "en": "milk",
                            "de": "Milch"
                        }
                    ],
                    "answer": "apple",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! ",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "The next item will always be the item with the shortest distance to the current one",
                            "de": "Der nächste Artikel wird immer jener sein mit der geringsten Distanz zum aktuellen"
                        }
                    }
                },
                {
                    "challengeId": "12",
                    "name": {
                        "en": "TSP 2",
                        "de": "TSP 2"
                    },
                    "algorithm": 6,
                    "shoppingList": ["STEAK", "CHIPS", "BROOM", "FISH", "CHEESE", "TANGERINE", "LEMONADE", "COLA", "WATER", "TOMATO"],
                    "supermarket": "LARGE",
                    "stopAtAnimation": 0,
                    "question": {
                        "en": "Where will Dev0 go after reaching the water",
                        "de": "Wohin wird Dev0 gehen, sobald er das Wasser erreicht hat?",
                        "type": "text"
                    },
                    "choices": [

                        {
                            "en": "cola",
                            "de": "Cola"
                        },
                        {
                            "en": "steak",
                            "de": "Steak"
                        },
                        {
                            "en": "lemonade",
                            "de": "Limonade"
                        },
                        {
                            "en": "broom",
                            "de": "Besen"
                        }
                    ],
                    "answer": "steak",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done! ",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "The next item will always be the item with the shortest distance to the current one",
                            "de": "Der nächste Artikel wird immer jener sein mit der geringsten Distanz zum aktuellen"
                        }
                    }
                }
            ]
        },
        {
            "name": "MODULE_SOCKS",
            "link": "socks",
            "chapters": [{
                    "chapterId": 1,
                    "conversation": [{
                            "speaker": "Narrator",
                            "en": "Due to Karin's great success in the library, she has less and less time for the daily housework. She therefore decides to ask Dev0 to do some of her housework.",
                            "de": "Aufgrund Karins großen Erfolg in der Bücherei, hat sie immer weniger Zeit für die tägliche Hausarbeit. Sie beschließt daher, Dev0 darum zu bitten, einen Teil ihrer Hausarbeit zu übernehmen."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hi Dev0, could you please sort my socks?",
                            "de": "Hi Dev0, könntest du bitte meine Socken sortieren?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Hello Karin, of course! But how exactly does socks sorting work?",
                            "de": "Hallo Karin, na klar! Aber wie genau funktioniert Socken sortieren?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "You take a sock out of the laundry basket and then look for its counterpart.",
                            "de": "Du nimmst aus dem Wäschekorb einen Socken raus und suchst dann nach dessen Gegenstück."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Once you find it, make a pair out of the two socks and set them aside",
                            "de": "Wenn du es gefunden hast, machst du ein Paar aus den zwei Socken und legst es beiseite"
                        },
                        {
                            "speaker": "Karin",
                            "en": "When there are no more socks in the basket, you're done!",
                            "de": "Wenn keine Socken mehr im Korb sind, bist du fertig!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Roger that! I'll get to work.",
                            "de": "Verstanden! Ich mache mich ans Werk."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 launches its first attempt as a sock sorter",
                            "de": "Dev0 startet seinen ersten Versuch als Sockensortierer"
                        },
                        {
                            "speaker": "Robot",
                            "en": "",
                            "de": "",
                            "showSimulation": "1a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 has finished sorting and shows Karin the result",
                            "de": "Dev0 ist fertig mit dem Sortieren und zeigt Karin das Ergebnis"
                        },
                        {
                            "speaker": "Karin",
                            "en": "That was quite quick, but only a first test, please try this slightly larger pile of socks now",
                            "de": "Das war ja ganz flott, aber nur ein erster Test, probier jetzt bitte diesen etwas größeren Sockenhaufen"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Roger!",
                            "de": "Alles klar!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "",
                            "de": "",
                            "showSimulation": "1b"
                        },
                        {
                            "speaker": "Karin",
                            "en": "You were a lot slower this time, can you explain to me what exactly you're doing?",
                            "de": "Diesmal warst du deutlich langsamer, kannst du mir erklären, was du genau machst?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Of course, I..",
                            "de": "Natürlich, und zwar.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "..take the first sock out of the basket. Now I pull a second sock out of the basket and compare the two socks.",
                            "de": "Nehme ich die erste Socke aus dem Korb. Jetzt ziehe ich eine zweite Socke aus dem Korb und vergleiche die beiden Socken.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "If they match, I make a pair and set it aside.",
                            "de": "Wenn sie übereinstimmen, mache ich ein Paar und lege es zur Seite.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "If not, I put the second sock back in the basket and pull out a new one",
                            "de": "Wenn nicht, lege ich die zweite Socke zurück in den Korb und ziehe eine neue"
                        },
                        {
                            "speaker": "Karin",
                            "en": "And here's the problem! You can't put back a sock that's already been compared.",
                            "de": "Und hier ist das Problem! Du kannst doch nicht eine bereits verglichene Socke zurücklegen.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Otherwise you may pull the same sock again.",
                            "de": "Sonst kann es sein, dass du die selbe Socke wieder ziehst."
                        },
                        {
                            "speaker": "Robot",
                            "en": "Ok what should I do with the compared sock instead?",
                            "de": "Ok was soll ich sonst machen mit der verglichenen Socke?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Just put them in a separate basket!",
                            "de": "Leg sie einfach in einen separaten Korb!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "All right, that's how I will do it.",
                            "de": "Alles klar, so mach ich es."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Very good, then could you try again on these socks right here.",
                            "de": "Sehr gut, dann versuch dich doch gleich an diesen Socken hier."
                        },
                        {
                            "speaker": "Robot",
                            "en": "With pleasure!",
                            "de": "Mit Vergnügen!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 starts next round with improved sorting algorithm.",
                            "de": "Dev0 startet mit verbessertem Sortieralgorithmus in die nächste Runde."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "1c"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 shows Karin the result..",
                            "de": "Dev0 zeigt Karin das Ergebnis.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "What happened here? They aren't sorted at all.",
                            "de": "Was ist denn hier passiert? Die sind ja gar nicht sortiert.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Oh, did you put the socks that didn't match in the second basket but always left them there?",
                            "de": "Ach, hast du etwa die Socken, die nicht übereinstimmen in den zweiten Korb gegeben aber dann immer dort gelassen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Yes, I did everything as you said",
                            "de": "Ja, ich habe alles so gemacht, wie du es gesagt hast"
                        },
                        {
                            "speaker": "Karin",
                            "en": "You have to put the socks from the second basket back into the first once you've found a pair!",
                            "de": "Du musst die Socken aus dem zweiten Korb wieder zurückgeben in den ersten, sobald du ein Paar gefunden hast!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "I didn't know that, but I'm happy to accept this requirement.",
                            "de": "Das habe ich nicht gewusst, aber ich nehme dieses Anforderung gerne auf."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Alright, one more try?",
                            "de": "Also gut, noch ein Versuch?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Certainly!",
                            "de": "Sicherlich!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "1d"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 shows Karin the result.",
                            "de": "Dev0 zeigt Karin das Ergebnis."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Nicely done Dev0, everything sorted and all in reasonable time, thank you!",
                            "de": "Super Dev0, alles sortiert und das ganze in akzeptabler Zeit, danke dir!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "You are welcome!",
                            "de": "Bitte gerne!"
                        }

                    ],
                    "simulations": [{
                            "name": "1a",
                            "algorithm": 1,
                            "collection": "SMALL"

                        },
                        {
                            "name": "1b",
                            "algorithm": 1,
                            "collection": "MEDIUM"

                        },
                        {
                            "name": "1c",
                            "algorithm": 2,
                            "collection": "MEDIUM"

                        },
                        {
                            "name": "1d",
                            "algorithm": 3,
                            "collection": "MEDIUM"

                        }

                    ]
                },
                {
                    "chapterId": 2,
                    "conversation": [

                        {
                            "speaker": "Narrator",
                            "en": "A new day is dawning and Karin asks Dev0 for its support again.",
                            "de": "Ein neuer Tag bricht an und Karin bitten Dev0 wieder um seine Unterstützung."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Hi Dev0, can you help me with my socks again?",
                            "de": "Hi Dev0, kannst du mir wieder mit meinen Socken helfen?"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Sure, I'll get to work.",
                            "de": "Klar! Ich machen mich an die Arbeit."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 applies its usual algorithm to a slightly larger set of socks.",
                            "de": "Dev0 wendet seinen üblichen Algorithmus an, an einer etwas größeren Menge an Socken."
                        },
                        {
                            "speaker": "Robot",
                            "en": "",
                            "de": "",
                            "showSimulation": "2a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "After successful sorting, Dev0 returns to Karin..",
                            "de": "Nach erfolgreichem Sortieren kehrt Dev0 zu Karin zurück.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Thanks Dev0, but that took a little longer than I had hoped for.",
                            "de": "Danke Dev0, aber das hat jetzt doch etwas länger gedauert als erhofft."
                        },
                        {
                            "speaker": "Robot",
                            "en": "Do you still see potential for improvement?",
                            "de": "Siehst du noch Verbesserungspotenzial?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Yes, how about, for example, if instead of putting the sorted socks in the second basket, you..",
                            "de": "Ja, wie wäre es zum Beispiel, wenn du anstatt die aussortierten Socken in den zweiten Korb zu geben,.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "..put them all next to each other. Then you take a sock from the basket and compare it with all the ones you took out.",
                            "de": "..sie alle nebeneinander aufzulegen. Dann nimmst du dir einen Socken aus dem Korb und vergleichst mit allen aufgelegten."
                        },
                        {
                            "speaker": "Robot",
                            "en": "Sounds good! I would like to try that right now, do you still have socks to sort?",
                            "de": "Klingt gut! Ich würde das gerne gleich versuchen, hast du noch Socken zu sortieren?"
                        },
                        {
                            "speaker": "Karin",
                            "en": "Try the same socks again!",
                            "de": "Probier doch die gleichen Socken noch einmal!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Gladly, I'll get to work.",
                            "de": "Gerne, ich mache mich ans Werk."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 starts the next round of sock sorting",
                            "de": "Dev0 startet in die nächste Runde Socken-Sortieren"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "2b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Karin is pleased with the significantly faster sorting.",
                            "de": "Karin ist erfreut von der deutlich schnelleren Sortierung.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Wow, that was really fast, thanks Dev0!",
                            "de": "Wow, das ging ja schon richtig flott, danke Dev0!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "You're welcome!",
                            "de": "Sehr gerne!"
                        }

                    ],
                    "simulations": [{
                            "name": "2a",
                            "algorithm": 3,
                            "collection": "LARGE"

                        },
                        {
                            "name": "2b",
                            "algorithm": 4,
                            "collection": "LARGE"

                        }
                    ]
                },
                {
                    "chapterId": 3,
                    "conversation": [

                        {
                            "speaker": "Narrator",
                            "en": "Karin needs Dev0's sorting services once again and asks him to sort a huge amount of socks..",
                            "de": "Karin benötigt wieder Dev0's Sortierdienste und bittet ihn, eine rießige Menge an Socken zu sortieren.."
                        },
                        {
                            "speaker": "Robot",
                            "en": "",
                            "de": "..",
                            "showSimulation": "3a"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 presents its result..",
                            "de": "Dev0 präsentiert sein Ergebnis.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Thanks for sorting, Dev0! But it seems the more socks you have to sort, the slower this approach will be.",
                            "de": "Danke für das Sortieren, Dev0! Aber es scheint so, dass dieser Ansatz immer langsamer wird bei steigender Anzahl an Socken."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Look, if the socks have different criteria such as colors and patterns, you could pre-sort them accordingly...",
                            "de": "Schau mal, wenn die Socken verschiedene Kriterien wie Farben und Muster haben, könntest du doch nach diesen vorsortieren,.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "That should make things a lot easier with huge sock amounts.",
                            "de": "Das sollte das ganze bei vielen Socken deutlich leichter machen."
                        },
                        {
                            "speaker": "Robot",
                            "en": "I understand, can you tell me the priority of the criteria you want me to sort by!",
                            "de": "Ich verstehe, bitte nenne mir die Priorität der Kriterien, nach denen ich sortieren soll!"
                        },
                        {
                            "speaker": "Karin",
                            "en": "How about sorting by color first, then if the pre-sorted socks aren't the same yet,..",
                            "de": "Wie wär's, wenn du zuerst nach Farbe sortierst, wenn dann die vorsortierten Socken noch nicht gleich sind,.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "..you sort by pattern next, then by pattern color and finally by number of stripes!",
                            "de": "..sortierst du als nächstes nach Muster, dann nach Musterfarbe und schließlich nach Streifenanzahl!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "All right, I'll try it again right away.",
                            "de": "Alles klar, ich probier's gleich noch mal."
                        },
                        {
                            "speaker": "Karin",
                            "en": "OK good luck!",
                            "de": "Ok, viel Erfolg!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 applies its new algorithm..",
                            "de": "Dev0 wendet seinen neuen Algorithmus an.."
                        },
                        {
                            "speaker": "Narrator",
                            "en": "",
                            "de": "",
                            "showSimulation": "3b"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "Dev0 proudly presents its result..",
                            "de": "Dev0 präsentiert stolz sein Ergebnis.."
                        },
                        {
                            "speaker": "Karin",
                            "en": "Wow, that was really quick, thank you!",
                            "de": "Wow, das war ja wirklich schnell, dankeschön!"
                        },
                        {
                            "speaker": "Robot",
                            "en": "Always at your service!",
                            "de": "Stets zu Diensten!"
                        },
                        {
                            "speaker": "Narrator",
                            "en": "You have reached the end of the socks story. Make your way to the laboratory and try your hand at customized socks and combine them with the algorithm and supermarket of your choice!",
                            "de": "Du bist am Ende der Socken Story angelangt. Mach dich auf den Weg ins Labor und versuche dich an individuell angepassten Socken und kombiniere mit Algorithmus und Supermarkt deiner Wahl!"
                        }

                    ],
                    "simulations": [{
                            "name": "3a",
                            "algorithm": 4,
                            "collection": "HUGE"

                        },
                        {
                            "name": "3b",
                            "algorithm": 5,
                            "collection": "HUGE"

                        }
                    ]
                }
            ],
            "algorithms": [{
                    "algorithmNr": 1,
                    "name": "Simple",
                    "lines": [{
                            "en": "Repeat until there is no more sock in the pile:",
                            "de": "Wiederhole, bis keine Socken mehr im Haufen sind:",
                            "indent": 0
                        },
                        {
                            "en": "Pick a sock from the pile",
                            "de": "Wähle einen Socken aus dem Haufen",
                            "indent": 1
                        },
                        {
                            "en": "Find its match in the pile",
                            "de": "Finde das Gegenstück",
                            "indent": 1
                        },
                        {
                            "en": "Put it aside",
                            "de": "Lege das Sockenpaar zur Seite",
                            "indent": 1
                        }
                    ]
                },
                {
                    "algorithmNr": 2,
                    "name": "SortOut",
                    "lines": [{
                            "en": "Repeat until there is no more sock in the pile:",
                            "de": "Wiederhole, bis keine Socken mehr im Haufen sind:",
                            "indent": 0
                        },
                        {
                            "en": "Pick a sock from the pile",
                            "de": "Wähle einen Socken aus dem Haufen",
                            "indent": 1
                        },
                        {
                            "en": "Take another sock and compare",
                            "de": "Nimm noch einen Socken und vergleiche",
                            "indent": 1,
                            "highlight": true
                        },
                        {
                            "en": "If they are the same:",
                            "de": "Wenn sie gleich sind:",
                            "indent": 1,
                            "highlight": true
                        },
                        {
                            "en": "Put the pair aside",
                            "de": "Lege das Sockenpaar zur Seite",
                            "indent": 2
                        },
                        {
                            "en": "Else:",
                            "de": "Ansonsten:",
                            "indent": 1,
                            "highlight": true
                        },
                        {
                            "en": "Put the second sock into basket2",
                            "de": "Lege den zweiten Socken in Korb2",
                            "indent": 2,
                            "highlight": true
                        }
                    ]
                },
                {
                    "algorithmNr": 3,
                    "name": "SortOutFixed",
                    "lines": [{
                            "en": "Repeat until there is no more sock in the pile:",
                            "de": "Wiederhole, bis keine Socken mehr im Haufen sind:",
                            "indent": 0
                        },
                        {
                            "en": "Pick a sock from the pile",
                            "de": "Wähle einen Socken aus dem Haufen",
                            "indent": 1
                        },
                        {
                            "en": "Take another sock and compare",
                            "de": "Nimm noch einen Socken und vergleiche",
                            "indent": 1
                        },
                        {
                            "en": "If they are the same:",
                            "de": "Wenn sie gleich sind:",
                            "indent": 1
                        },
                        {
                            "en": "Put the pair aside",
                            "de": "Lege das Sockenpaar zur Seite",
                            "indent": 2
                        },
                        {
                            "en": "Merge the baskets",
                            "de": "Vereine die Korbinhalte",
                            "indent": 2,
                            "highlight": true
                        },
                        {
                            "en": "Else:",
                            "de": "Ansonsten:",
                            "indent": 1
                        },
                        {
                            "en": "Put the second sock into basket2",
                            "de": "Lege den zweiten Socken in Korb2",
                            "indent": 2
                        }
                    ]
                },
                {
                    "algorithmNr": 4,
                    "name": "SimpleDivideAndSweep",
                    "lines": [{
                            "en": "Pick a sock and put it in a box",
                            "de": "Wähle einen Socken und gib ihn in eine Box",
                            "indent": 0
                        },
                        {
                            "en": "Repeat for all other socks:",
                            "de": "Wiederhole für alle anderen Socken:",
                            "indent": 0
                        },
                        {
                            "en": "Pick a sock",
                            "de": "Wähle einen Socken",
                            "indent": 1
                        },
                        {
                            "en": "If it matches a sock in one of the boxes:",
                            "de": "Wenn er ident ist mit einem Socken aus einer Box",
                            "indent": 1
                        },
                        {
                            "en": "Match it and put it in the final pile",
                            "de": "Gib sie zusammen und lege das Paar zur Seite",
                            "indent": 2
                        }
                    ]
                },
                {
                    "algorithmNr": 5,
                    "name": "DivideAndSweep",
                    "lines": [{
                            "en": "Repeat for each criteria (color, pattern..):",
                            "de": "Wiederhole für jedes Sockenkriterium (Farbe, Muster..):",
                            "indent": 0
                        },
                        {
                            "en": "Divide all socks by criteria into boxes",
                            "de": "Teile alle Socken nach dem Kriterium in Boxen",
                            "indent": 1
                        },
                        {
                            "en": "If all socks in a box are identical:",
                            "de": "Wenn alle Socken in einer Box ident sind",
                            "indent": 1
                        },
                        {
                            "en": "Make pairs from that box to the final pile",
                            "de": "Mache Sockenpaare aus ihnen und lege sie zur Seite",
                            "indent": 2
                        },
                        {
                            "en": "If all boxes are empty",
                            "de": "Wenn alle Boxen leer sind",
                            "indent": 1
                        },
                        {
                            "en": "Stop the algorithm",
                            "de": "stoppe den Algorithmus",
                            "indent": 2
                        }

                    ]
                }
            ],
            "sockCollections": [{
                    "name": "SMALL",
                    "socks": [{
                            "color": "red",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        }
                    ]
                },
                {
                    "name": "MEDIUM",
                    "socks": [{
                            "color": "red",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        }

                    ]
                },
                {
                    "name": "LARGE",
                    "socks": [

                        {
                            "color": "purple",
                            "lineAmount": 3,
                            "pattern": "None",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 3,
                            "pattern": "None",
                            "patternColor": "green",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 3,
                            "pattern": "heart",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 3,
                            "pattern": "heart",
                            "patternColor": "green",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "green",
                            "type": "double"
                        }

                    ]
                },
                {
                    "name": "HUGE",
                    "socks": [

                        {
                            "color": "magenta",
                            "lineAmount": 2,
                            "pattern": "heart",
                            "patternColor": "magenta",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "patternColor": "magenta",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "#006699",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "#006699",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 3,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "darkgrey",
                            "lineAmount": 3,
                            "pattern": "heart",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "darkgrey",
                            "lineAmount": 3,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        }
                    ]
                },
                {
                    "name": "CUSTOM",
                    "socks": [{
                            "color": "lime",
                            "lineAmount": 2,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "maroon",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "orange",
                            "type": "double"
                        },
                        {
                            "color": "navy",
                            "lineAmount": 0,
                            "pattern": "TU",
                            "patternColor": "#006699",
                            "type": "double"
                        }
                    ]
                }
            ],
            "colors": [
                "black", "#343434", "darkgrey", "orange", "#E30B5C", "red", "maroon", "yellow", "#FFBF00", "olive", "lime", "green", "aqua", "#006699", "teal", "blue", "navy", "fuchsia", "#AA336A", "purple"
            ],
            "challenges": [{
                    "challengeId": "1",
                    "name": {
                        "en": "first steps",
                        "de": "Erste Schritte"
                    },
                    "algorithm": 1,
                    "socks": [{
                            "color": "lime",
                            "lineAmount": 2,
                            "pattern": "dots",
                            "patternColor": "navy",
                            "type": "double"
                        },
                        {
                            "color": "maroon",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "orange",
                            "type": "double"
                        }
                    ],
                    "sockOrder": [0, 1, 0, 1, 1],
                    "question": {
                        "en": "How many comparisons will there be if the socks are drawn in the following order?",
                        "de": "Wieviele Vergleiche wird es geben, wenn die Socken in folgender Reihenfolge gezogen werden?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "2",
                            "de": "2"
                        },
                        {
                            "en": "3",
                            "de": "3"
                        },
                        {
                            "en": "4",
                            "de": "4"
                        },
                        {
                            "en": "5",
                            "de": "5"
                        }
                    ],
                    "answer": "3",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Not quite right, try again!",
                            "de": "Nicht ganz richtig, versuch's noch mal!"
                        }
                    }
                },
                {
                    "challengeId": "2",
                    "name": {
                        "en": "this is fine",
                        "de": "..in Ordnung"
                    },
                    "algorithm": 1,
                    "socks": [{
                            "color": "purple",
                            "lineAmount": 3,
                            "pattern": "dots",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "magenta",
                            "type": "double"
                        }
                    ],
                    "sockOrder": [0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1],
                    "question": {
                        "en": "How many sock movements will there be if the socks are drawn in the following order?",
                        "de": "Wieviele Sockenbewegungen wird es geben, wenn die Socken in folgender Reihenfolge gezogen werden?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "6",
                            "de": "6"
                        },
                        {
                            "en": "8",
                            "de": "8"
                        },
                        {
                            "en": "10",
                            "de": "10"
                        },
                        {
                            "en": "12",
                            "de": "12"
                        }
                    ],
                    "answer": "8",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Every sock is only moved twice with this algorithm",
                            "de": "Jeder Socken wird nur zweimal bewegt bei diesem Algorithmus"
                        }
                    }
                },
                {
                    "challengeId": "3",
                    "name": {
                        "en": "another basket 1",
                        "de": "Noch ein Korb 1"
                    },
                    "algorithm": 2,
                    "socks": [{
                            "color": "teal",
                            "lineAmount": 3,
                            "pattern": "JKU",
                            "patternColor": "teal",
                            "type": "double"
                        },
                        {
                            "color": "fuchsia",
                            "lineAmount": 2,
                            "pattern": "heart",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "blue",
                            "type": "double"
                        },
                        {
                            "color": "black",
                            "lineAmount": 0,
                            "pattern": "TU",
                            "patternColor": "black",
                            "type": "double"
                        }
                    ],
                    "sockOrder": [0, 1, 2, 3, 0, 1, 2, 3],
                    "question": {
                        "en": "How many sock pairs will end up sorted?",
                        "de": "Wieviele Sockenpaare werden geordnet sein?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "4",
                            "de": "4"
                        },
                        {
                            "en": "1",
                            "de": "1"
                        },
                        {
                            "en": "3",
                            "de": "3"
                        },
                        {
                            "en": "0",
                            "de": "0"
                        }
                    ],
                    "answer": "1",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Can you see the flaw in the algorithm?",
                            "de": "Kannst du den Fehler in diesem Algorithmus sehen?"
                        }
                    }
                },
                {
                    "challengeId": "4",
                    "name": {
                        "en": "another basket 2",
                        "de": "Noch ein Korb 2"
                    },
                    "algorithm": 2,
                    "socks": [{
                            "color": "teal",
                            "lineAmount": 3,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "fuchsia",
                            "lineAmount": 2,
                            "pattern": "heart",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "blue",
                            "type": "double"
                        },
                        {
                            "color": "black",
                            "lineAmount": 0,
                            "pattern": "TU",
                            "patternColor": "#006699",
                            "type": "double"
                        }
                    ],
                    "sockOrder": [0, 0, 3, 1, 2, 2, 1, 3],
                    "question": {
                        "en": "How many sock pairs will end up sorted?",
                        "de": "Wieviele Sockenpaare werden geordnet sein?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "2",
                            "de": "2"
                        },
                        {
                            "en": "1",
                            "de": "1"
                        },
                        {
                            "en": "3",
                            "de": "3"
                        },
                        {
                            "en": "4",
                            "de": "4"
                        }
                    ],
                    "answer": "2",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Can you see the flaw in the algorithm?",
                            "de": "Kannst du den Fehler in diesem Algorithmus sehen?"
                        }
                    }
                },
                {
                    "challengeId": "5",
                    "name": {
                        "en": "merge it",
                        "de": "zusammenfügen"
                    },
                    "algorithm": 3,
                    "socks": [{
                            "color": "fuchsia",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 3,
                            "pattern": "JKU",
                            "patternColor": "green",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "orange",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [0, 0, 1, 2, 2, 1, 2, 2],
                    "question": {
                        "en": "How many sock pairs will end up sorted?",
                        "de": "Wieviele Sockenpaare werden geordnet sein?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "1",
                            "de": "1"
                        },
                        {
                            "en": "0",
                            "de": "0"
                        },
                        {
                            "en": "3",
                            "de": "3"
                        },
                        {
                            "en": "2",
                            "de": "2"
                        }
                    ],
                    "answer": "3",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "This algorithm will always end up with all socks sorted!",
                            "de": "Mit diesem Algorithmus werden immer alle Socken sortiert!"
                        }
                    }
                },
                {
                    "challengeId": "6",
                    "name": {
                        "en": "count it!",
                        "de": "zähl mit!"
                    },
                    "algorithm": 3,
                    "socks": [{
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "green",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 3,
                            "pattern": "TU",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "brown",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "brown",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "orange",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [3, 1, 2, 3, 2, 0, 2, 1, 0, 1, 0, 0],
                    "question": {
                        "en": "How many sock pairs will end up sorted?",
                        "de": "Wieviele Sockenpaare werden geordnet sein?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "4",
                            "de": "4"
                        },
                        {
                            "en": "6",
                            "de": "6"
                        },
                        {
                            "en": "8",
                            "de": "8"
                        },
                        {
                            "en": "10",
                            "de": "10"
                        }
                    ],
                    "answer": "8",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Try again!",
                            "de": "Probier's noch mal!"
                        }
                    }
                },
                {
                    "challengeId": "7",
                    "name": {
                        "en": "divide it up",
                        "de": "teil es auf"
                    },
                    "algorithm": 4,
                    "socks": [{
                            "color": "red",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "blue",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "purple",
                            "type": "double"
                        },
                        {
                            "color": "darkgrey",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "darkgrey",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [3, 2, 0, 1, 2, 1, 0, 3],
                    "question": {
                        "en": "How many sock movements will there be?",
                        "de": "Wieviele Sockenbewegungen wird es geben?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "8",
                            "de": "8"
                        },
                        {
                            "en": "12",
                            "de": "12"
                        },
                        {
                            "en": "16",
                            "de": "16"
                        },
                        {
                            "en": "24",
                            "de": "24"
                        }
                    ],
                    "answer": "16",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Try again!",
                            "de": "Probier's noch mal!"
                        }
                    }
                },
                {
                    "challengeId": "8",
                    "name": {
                        "en": "more dividing",
                        "de": "teile mehr"
                    },
                    "algorithm": 4,
                    "socks": [{
                            "color": "darkgrey",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "darkgrey",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "green",
                            "type": "double"
                        },
                        {
                            "color": "fuchsia",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "fuchsia",
                            "type": "double"
                        },
                        {
                            "color": "black",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "orange",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "orange",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "blue",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [0, 1, 2, 3, 4, 5, 5, 4, 3, 2, 1, 0],
                    "question": {
                        "en": "How many sock comparisons will there be?",
                        "de": "Wieviele Sockenvergleiche wird es geben?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "24",
                            "de": "24"
                        },
                        {
                            "en": "30",
                            "de": "30"
                        },
                        {
                            "en": "36",
                            "de": "36"
                        },
                        {
                            "en": "64",
                            "de": "64"
                        }
                    ],
                    "answer": "36",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Try again!",
                            "de": "Probier's noch mal!"
                        }
                    }
                },
                {
                    "challengeId": "9",
                    "name": {
                        "en": "categories 1",
                        "de": "Kategorien 1"
                    },
                    "algorithm": 5,
                    "socks": [{
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 1,
                            "pattern": "heart",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "purple",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [1, 4, 0, 3, 2, 5, 1, 4, 0, 3, 2, 5],
                    "question": {
                        "en": "How many sock movements will there be?",
                        "de": "Wieviele Sockenbewegungen wird es geben?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "24",
                            "de": "24"
                        },
                        {
                            "en": "36",
                            "de": "36"
                        },
                        {
                            "en": "48",
                            "de": "48"
                        },
                        {
                            "en": "64",
                            "de": "64"
                        }
                    ],
                    "answer": "36",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Look at how many criteria are needed to distinguish the socks, add 1 for the final move and multiply by nr of socks",
                            "de": "Schau dir an, wieviel Kriterien nötig sind, um die Socken aufzuteilen, addiere 1 für die letzte Bewegung und multipliziere mit der Anzahl an Socken"
                        }
                    }
                },
                {
                    "challengeId": "10",
                    "name": {
                        "en": "categories 2",
                        "de": "Kategorien 2"
                    },
                    "algorithm": 5,
                    "socks": [{
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "green",
                            "lineAmount": 1,
                            "pattern": "TU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "red",
                            "type": "double"
                        },
                        {
                            "color": "blue",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "red",
                            "lineAmount": 1,
                            "pattern": "JKU",
                            "patternColor": "black",
                            "type": "double"
                        },
                        {
                            "color": "red",
                            "lineAmount": 1,
                            "pattern": "dots",
                            "patternColor": "black",
                            "type": "double"
                        }

                    ],
                    "sockOrder": [1, 4, 0, 3, 2, 5, 1, 4, 0, 3, 2, 5],
                    "question": {
                        "en": "How many sock movements will there be?",
                        "de": "Wieviele Sockenbewegungen wird es geben?",
                        "type": "text"
                    },
                    "choices": [{
                            "en": "36",
                            "de": "36"
                        },
                        {
                            "en": "44",
                            "de": "44"
                        },
                        {
                            "en": "52",
                            "de": "52"
                        },
                        {
                            "en": "64",
                            "de": "64"
                        }
                    ],
                    "answer": "44",
                    "endMessage": {
                        "messageCorrect": {
                            "en": "Well done!",
                            "de": "Gut gemacht!"
                        },
                        "messageWrong": {
                            "en": "Some of these socks are sorted earlier than others, look at the criteria!",
                            "de": "Einige dieser Socken werden schneller sortiert als andere, schau auf die Kriteren!"
                        }
                    }
                }


            ]
        }


    ]
}